{
    "Magnavox Odyssey":
    "The Odyssey holds the distinction of being the very first home video game console. Designed by a team led by Ralph Baer, it consists of a white, black and brown box that connects to a television set. Games were played using two rectangular, wired controllers with dial knobs on each side which were used to control the vertical and horizontal movement of the player. Graphically, the system was capable to displaying 3 square dots and one line of varying height on the screen in monochrome black and white with plastic overlays used to distinguish different games. \nThe behavior of the player's square dot depended on the game that was being played. Interestingly, although the Odyssey is the oldest game console, the games themselves came on printed circuit board 'cartridges', a novel approach considering most systems that followed would use built-in games. 28 games in total were released for the system including a 'ping-pong' game which became the inspiration for ATARI's 'Pong'. \nPatents by Baer, deemed by a judge to be 'the pioneering patent of the video game art' became the basis for a 20 year long series of lawsuits between Magnavox and ATARI. The Magnavox Odyssey was ahead of its time in many respects and marked the beginning of the first generation of video game consoles and was an early part of the rise of the commercial video game industry.",
    
    "TV Tennis Electrotennis":
    "TV Tennis Electrotennis was the first dedicated home game console released in Japan. The system has two sets of dial knobs used to control each player's paddle which are part of the console itself. The long, bright red system was unique both in being the first Japanese game console and the fact that it was wireless. It connected to a television set via a UHF antenna. This wireless feature even got Nintendo designer Masayuki Uemura to consider adding that capability to the Famicom (Nintendo Entertainment System), though he ultimately did not pursue it to keep system costs low.",
    
    "Fairchild Channel F":
    "The Fairchild Channel 'Fun' was the first video game console to be based on a microprocessor as well as the first to use ROM cartridges instead of having games built-in. Although not a massive hit with consumers (the system only sold 350,000 units), it's use of a microprocessor and interchangeable circuit boards containing ROM chips for games was a significant advancement in the early industry. The Channel F managed to beat ATARI's release of the ATARI VCS but ultimately once the VCS hit shelves, sales of the Channel F plummeted. In the end, Fairchild sold the technology to Zircon International in 1979 and the system was discontinued in 1983.",

    "Telstar Arcade":
    "The Coleco Telstar Arcade was one of many consoles released under the 'Telstar' brand. It was a very unique, but cluttered triangular design, with each side of the console containing a specific type of input. One side has an attached wheel for driving games while another side contain a revolver style lightgun. The 'front' of the console has more conventional control dial knobs and basic inputs. The console was microprocessor based and games came on silver-colored, triangular carts, each containing its own microcontroller. Out of all the consoles released in the 'Telstar' line, the Telstar Arcade was the most advanced.",

    "Color TV-Game 6":
    "The Color TV-Game 6 holds major significant as being the first video game system that Nintendo ever made. By the late 1970's, Nintendo began moving away from producing toys and playing cards and into the then rapidly expanding video game market. As the name suggests, this system contains 6 built-in games and was but one of a line of consoles released under the 'TV-Game' line. \nThe Color TV-Game consoles were produced jointly by Nintendo Research & Development 2 (R&D2) and Mitsubishi Electronics. Nintendo had no prior experience in manufacturing electronics at that time and so needed the help developing and producing units. \nThe Nintendo president at this time was Hiroshi Yamauchi who specified that the consoles be produced quickly and with cheaper parts to reduce production costs. He wanted a competitive edge by making the systems cheap for the consumer to purchase. The TV-Game 6 and 15 required little production time due to their simplicity. Mitsubishi made minor changes and corrections to the systems before they were released. This strategy would go on to become a mainstay at Nintendo leading into the present day. \n The legacy and significance of the Color TV-Game 6 can not be understated as it was the foundation upon which Nintendo would build upon and ultimately led to the design and release of the Nintendo Entertainment System.",

    "Atari 2600":
    "The 2600, first branded as the 'Atari Video Computer System (Atari VCS) is iconic, legendary and infamous. It popularized the use of microprocessor-based hardware and the use of ROM based game cartridges and sported a game library that included home ports of the most popular arcade games at the time, Space Invaders and Pac-Man. \nThe woodgrain styled console and iconic CX40 single-button Joystick sold a whopping 30 million units during what was at the time a very hot, expanding video game market. However, for as important as the 2600 was in terms of it's impact on the games industry it also carries with it the distinction of being the system that was at the center of the 1984 video game crash. Although the 2600 had a library of what were certainly the most popular video games at the time, the quality and quantity quickly degraded as a wave of third-party shovelware games overwhelmed the market. \nThe well known story of E.T. and technically inferior port of Pac-Man marked the beginning of Atari's downfall and the loss of consumer confidence in the brand. It wouldn't be until 1985 when Nintendo would come along to reignite the industry with the Nintendo Entertainment System.",

    "Bally Astrocade":
    "This short-lived system marked Bally's brief foray into the video games market. While mostly known for producing pinball tables, Bally's video games division, Midway, would design the Astrocade in an attempt to join the extremely busy video game market at that time. Although technically competent in terms of system specs, the console itself never reached mass consumer adoption partly due to production delays and being initially available only by mail-order. \nBy the time the Astrocade made it to the conventional retail store shelves, it had been rebranded as the 'Bally Professional Arcade'. One unique feature was that the system came bundled with a BASIC programming language cartridge. Commands were entered via the controller keypad which contained a plastic overlay displaying letters, symbols and BASIC keywords. The system continued to struggle though out the late 1970's and early 1980's until Bally ultimately sold the rights and decided to exit the market.",

    "Magnavox Odyssey 2":
    "Building on what Magnavox learned with the Odyssey, the Odyssey 2 contained a number of improvements and advancements. One of the important changes was the introduction of swappable ROM carts which let consumers build a game collection that matched preferred style and genre. \nThe system also included a full alphanumeric membrane keyboard which was to be used for educational games, selecting options or programming by way of the 'Computer Intro!' cartridge. Another advanced feature for the time was it's speech synthesis add-on to be used for speech, music and sound effects. \nOdyssey 2 also saw a wide market release being sold in multiple regions such as Europe, Brazil and Japan. However, despite the long market reach, Odyssey 2 only sold around 2 million units and would be one of the four major home consoles that would experience the 1983 video game market crash.",

    "Intellivision":
    "The Intellivision ('intelligent television') was Mattel Electronics foray into the video game market. One of the advantages that Mattel had on their side was their team of talented programmers who knew how to get the most out of the systems hardware. More importantly though was their ability to create new and novel games at a time when most companies relied heavily on licensing existing properties like cartoons, movies and television shows. \nThe system had the iconic woodgrain styling which was prevalent at the time and a numeric keypad controller that would be overlaid with various plastic sheets for specific games. Innovation and novelty drove a lot Mattel's decisions as they experimented with a lot of then unseen peripherals. These included a keyboard, Intellivoice voice synthesis module and a computer module that would turn the system into a home computer. The most compelling add-on was the 'PlayCable' which allowed games to be downloaded to the system, although this service was short-lived. \nThough the system remained in production until 1990, sales and market share were drastically reduced due to the 1983 video game crash.",

    "Vectrex":
    "The Vectrex is most well known as the only home video game console to have used Vector based graphics instead of raster graphics. This made the graphics sharper and scalable but also limited in what kind of images the system could produce. Rather than being plugged in to a television set, the Vectrex had a dedicated monitor as part of the system within which a small, wired controller could be attached. To compensate for the lack of graphical details that could be produced using vector graphics, the system utilized the common approach of plastic screen overlays that would add context to a specific game's graphics. \nTwo major peripherals were released for the system which were a pair of 3D goggles that allowed for simple 3D effects and a light pen would could be used to draw images directly on the screen. Although novel and innovative, the Vectrex wasn't a big seller and is considered a commercial failure. Milton Bradley purchased the rights to the system and tried to expand the system's reach by releasing it in Europe and Japan in a partnership with Bandai. However, this was too little too late as the system was yet another victim of the 1983 video game crash.",

    "Atari 5200":
    "Created as a follow up to the 2600 and a more high-end system intended to compete with the Intellivision, the Atari 5200 was unfortunately unremarkable. It's main competitor ended up being the ColecoVision and although the 5200 had nearly identical specs to Atari's other 8-bit systems, there was no backward compatibility which led to an ultimately unimpressive library of games. While the ColecoVision had the first home version of Nintendo's Donkey King, the 5200 shippped the 1978 arcade game Super Breakout which had already appeared on the Atari 2600. \nThe system's controller was a non centering 360 degree joystick with a full keypad which was designed to improve upon the 2600's iconic single button joystick, however this new controller ended up being one of the main sources of criticism. Ultimately, the system was formally discontinued just two years after launch and sold only 1 million units, far short of its predecessors sales of over 30 million",

    "ColecoVision":
    "The ColecoVision offered a closer experience to more powerful arcade video games compared to competitors such as the Atari 2600 and Intellivision. The initial catalog of twelve games on ROM cartridge included the first home version of Nintendo's Donkey Kong as the pack-in game. Approximately 136 games were published between 1982 and 1984, including Sega's Zaxxon and some ports of lesser known arcade games that found a larger audience on the console, such as Lady Bug, Cosmic Avenger, and Venture. \nColeco released a series of hardware add-ons and special controllers to expand the capabilities of the console. 'Expansion Module #1' allowed the system to play Atari 2600 cartridges. A later module converted ColecoVision into the Coleco Adam home computer. ColecoVision was discontinued in 1985 when Coleco withdrew from the video game market. Coleco had already contemplated shifting focus to their Cabbage Patch Kids success after the costly failure of their Coleco Adam computer.",

    "Casio PV-1000":
    "Casio made a brief attempt at entering the video game market in 1983, in the exact year that the video game industry experienced a major market crash. The timing couldn't be worse for the PV-1000 as was discontinued less than a year after release. Only 13 games were made for the system and it was only released in Japan, further limiting its success.",

    "Nintendo Entertainment System":
    "After developing several successful arcade games in the early 1980s such as Donkey Kong (1981), Nintendo planned to create a home video game console. Rejecting more complex proposals, the Nintendo president Hiroshi Yamauchi called for a simple, cheap console with games stored on cartridges. The controller design was reused from Nintendo's portable Game & Watch games. Nintendo released several add-ons, such as the NES Zapper light gun for shooting games like Duck Hunt. \nThe NES is one of the best-selling consoles of its time and helped revitalize the US gaming industry following the video game crash of 1983. It introduced a now-standard business model of licensing third-party developers to produce and distribute games. The NES features a number of groundbreaking games, such as the 1985 platform game Super Mario Bros. and the 1986 action-adventure games The Legend of Zelda and Metroid, which became long-running franchises. It was succeeded in 1990 by the Super Nintendo Entertainment System.",

    "SG-1000":
    "The SG-1000 is a home video game console manufactured by Sega. It was Sega's first entry into the home video game hardware business. Developed in response to a downturn in arcades starting in 1982, the SG-1000 was created on the advice of Hayao Nakayama, president of Sega's Japanese arm, and was released on July 15, 1983, the same day that Nintendo released the Family Computer in Japan. It also saw limited release in Australia and New Zealand. \nThe SG-1000 was released in several forms, including the SC-3000 computer and the redesigned SG-1000 II released in 1984. The SG-1000 and the SC-3000 both support a library of 76 ROM cartridge games and 29 Sega My Card games. \nA third iteration of the console, the Sega Mark III, was released in 1985. It provided an improved custom video display processor over previous iterations and served as the basis for the Master System in 1986, Sega's first internationally released console. All SG-1000 games are fully compatible with the Mark III and the Japanese version of the Master System.",

    "Philips Videopac+ G7400":
    "The G7400 was the successor to the Philips Videopac G7000, the European counterpart to the American Magnavox Odyssey 2. The system featured excellently tailored background and foreground graphics. The G7400 could play three types of games: all normal G7000 games, special G7000 games with additional high-res background graphics that would appear only when played on the G7400, and G7400-only games with high-res sprites and backgrounds.",

    "Super Cassette Vision":
    "Released in Japan on July 17, 1984, and in Europe, specifically France, later in 1984. A successor to the Cassette Vision, it competed with Nintendo's Family Computer and Sega's SG-1000 line in Japan. Epoch's original Cassette Vision was introduced in Japan by Epoch in 1981, which had steady sales and took over 70% of the Japanese home console market at the time, with around 400,000 units sold. However, the introduction of next-generation systems from Nintendo, Casio and Sega quickly pushed back the original Cassette Vision, leading Epoch to quickly develop a successor. The Super Cassette Vision was released in 1984 at a cost of ¥14,800 yen, featuring an 8-bit processor and better performance more in line with its competitors. \nIt was later released in France by ITMC under the Yeno branding. At least 16 games were brought over from Japan for a European release. A version of the system targeted the young female market, the Super Lady Cassette Vision. The console came packed in a pink carrying case, alongside the game Milky Princess. The system did not take off, and was unable to match the massive popularity of the Nintendo Famicom, leading Epoch to drop out of the console market by 1987.",

    "Master System":
    "The Master System was released in competition with the Nintendo Entertainment System (NES). Its library is smaller and with fewer well-reviewed games than the NES, due in part to Nintendo licensing policies requiring platform exclusivity. Though the Master System had newer, improved hardware, it failed to overturn Nintendo's significant market share advantage in Japan and North America. However, it attained significantly greater success in other markets, including Europe, Brazil, South Korea and Australia. \nThe Sega Master System is estimated to have sold between 10 and 13 million units worldwide. In addition, Tectoy has sold 8 million licensed Master System variants in Brazil. Retrospective criticism has recognized its role in the development of the Sega Genesis, and a number of well-received games, particularly in PAL (including PAL-M) regions, but is critical of its limited library in the NTSC regions, which were dominated by the NES.",

    "Atari 7800":
    "The Atari 7800 ProSystem, or simply the Atari 7800, is a home video game console officially released by Atari Corporation in 1986 as the successor to both the Atari 2600 and Atari 5200. It can run almost all Atari 2600 cartridges, making it one of the first consoles with backward compatibility. It shipped with a different model of joystick from the 2600-standard CX40 and Pole Position II as the pack-in game. Most of the announced titles at launch were ports of 1981-1983 arcade video games. \nDesigned by General Computer Corporation, the 7800 has significantly improved graphics hardware over Atari's previous consoles, but the same Television Interface Adaptor chip that launched with the 2600 in 1977 is used to generate audio. In an effort to prevent the flood of poor quality games that contributed to the video game crash of 1983, cartridges had to be digitally signed by Atari. \nThe Atari 7800 was first announced by Atari, Inc. on May 21, 1984, but a general release was shelved until May 1986 due to the sale of the company. Atari Corporation dropped support for the 7800, along with the 2600 and the Atari 8-bit family, on January 1, 1992.",

    "TurboGrafx-16 / PC Engine":
    "The TurboGrafx-16, known as the PC Engine outside North America, is a home video game console designed by Hudson Soft and sold by NEC Home Electronics. It was the first console marketed in the fourth generation, commonly known as the 16-bit era, though the console has an 8-bit central processing unit (CPU) coupled with a 16-bit graphics processor. It was released in Japan in 1987 and in North America in 1989. In Europe, the console is known as the PC Engine, after the Japanese model was imported and distributed in the United Kingdom and France from 1988. In Japan, the system was launched as a competitor to the Famicom, but the delayed United States release meant that it ended up competing with the Sega Genesis and later the Super NES.",

    "Sega Genesis / Mega Drive":
    "The Sega Genesis, known as the Mega Drive outside North America, is a 16-bit fourth generation home video game console developed and sold by Sega. It was Sega's third console and the successor to the Master System. Sega released it in 1988 in Japan as the Mega Drive, and in 1989 in North America as the Genesis. In 1990, it was distributed as the Mega Drive by Virgin Mastertronic in Europe, Ozisoft in Australasia, and Tectoy in Brazil. In South Korea, it was distributed by Samsung Electronics as the Super Gam*Boy and later the Super Aladdin Boy. \nDesigned by an R&D team supervised by Hideki Sato and Masami Ishikawa, the Genesis was adapted from Sega's System 16 arcade board, centered on a Motorola 68000 processor as the CPU, a Zilog Z80 as a sound controller, and a video system supporting hardware sprites, tiles, and scrolling. It plays a library of more than 900 games on ROM-based cartridges. Several add-ons were released, including a Power Base Converter to play Master System games. It was released in several different versions, some created by third parties. Sega created two network services to support the Genesis: Sega Meganet and Sega Channel.",

    "Atari Lynx":
    "The Atari Lynx is a hybrid 8/16-bit hand-held game console released by Atari Corporation in September 1989 in North America and 1990 in Europe and Japan. It was the first handheld game console with a color liquid-crystal display. Powered by a 16 MHz 65C02 8-bit CPU and a custom 16-bit blitter, the Lynx was more advanced than Nintendo's monochrome Game Boy, released two months earlier. It also competed with Sega's Game Gear and NEC's TurboExpress, released the following year. \nThe system was developed at Epyx by two former designers of the Amiga personal computers. The project was called the Handy Game or simply Handy. In 1991, Atari replaced the Lynx with a smaller model internally referred to as the Lynx II. Atari published a total of 73 games for the Lynx before it was discontinued in 1995.",

    "Game Boy":
    "The Game Boy is an 8-bit handheld game console developed and manufactured by Nintendo. It was designed by the same team that developed the Game & Watch series of handheld electronic games and several Nintendo Entertainment System (NES) games: Satoru Okada, Gunpei Yokoi, and Nintendo Research & Development 1. \nIt is Nintendo's second handheld game console and combines features from both the Game & Watch handheld and NES home system. The console features a dot-matrix screen with adjustable contrast dial, five game control buttons (a directional pad, two game buttons, and START and SELECT), a single speaker with adjustable volume dial and, like its rivals, uses cartridges as physical media for games. The color scheme is made from two tones of grey with accents of black, blue, and dark magenta. All the corners of the portrait-oriented rectangular unit are softly rounded, except for the bottom right, which is curved. At launch, it was sold either as a standalone unit, or bundled with one of several games, among them Super Mario Land and Tetris. Several accessories were also developed, including a carrying pouch, a camera, and a printer. \nThe Game Boy received mixed reviews from critics and was deemed technologically inferior to its fourth-generation competitors (Sega's Game Gear, Atari's Lynx, and NEC's TurboExpress). Its lack of a backlight, graphics, bulky design and price were met with criticism, but it also received praise for its battery life, library of games and durability in its construction. It quickly outsold the competition, selling one million units in the United States within a few weeks. An estimated 118.69 million units of the Game Boy and its successor, the Game Boy Color, have been sold worldwide, making it the fourth best-selling video game console of all time. It is one of the most recognizable devices from the 1990s, becoming a cultural icon in the years following its release. Several redesigns were released during the console's lifetime, including the Game Boy Pocket in 1996 and the Game Boy Light in 1998 (Japan only). Production of the Game Boy continued until 2003, well after the release of its second successor, the Game Boy Advance, in 2001.",

    "Neo Geo AES":
    "The Neo Geo originally launched as the Multi Video System (MVS) coin-operated arcade machine. With its games stored on self-contained cartridges, a game cabinet can easily be changed to a different game title by swapping the game's cartridge and cabinet artwork. The MVS offers owners the ability to put up to six different cartridges into a single cabinet, a unique feature that was a key economic consideration for operators with limited floorspace, as well as saving money long term. \nA home console version was also made, called Advanced Entertainment System (AES). It was originally released solely as a rental console for video game stores in Japan called the Neo Geo Rental System, with its high manufacturing costs causing SNK not to release it for retail sale. This was later reversed due to high demand and it was released at retail as a luxury console. Adjusted for inflation, it was the most expensive home video game console ever released, costing US$649.99 (equivalent to $1,397 in 2022). The AES had identical hardware to the MVS, allowing home users to play the games exactly as they were in the arcades.",

    "Game Gear":
    "The Game Gear primarily competed with Nintendo's Game Boy, the Atari Lynx, and NEC's TurboExpress. It shares much of its hardware with the Master System, and can play Master System games through the use of an adapter. Sega positioned the Game Gear, which had a full-color backlit screen with a landscape format, as a technologically superior handheld to the Game Boy. \nThough the Game Gear was rushed to market, its unique game library and price point gave it an edge over the Atari Lynx and TurboExpress. However, due to its short battery life, lack of original games, and weak support from Sega, the Game Gear was unable to surpass the Game Boy, selling 10.62 million units by March 1996. The Game Gear was discontinued in 1997. It was re-released as a budget system by Majesco Entertainment in 2000, under license from Sega. \nReception of the Game Gear was mixed, with praise for its full-color backlit screen and processing power for its time, criticisms over its large size and short battery life, and questions over the quality of its game library.",

    "Super Nintendo Entertainment System":
    "The Super NES is Nintendo's second home console, following the Nintendo Entertainment System (NES). The console introduced advanced graphics and sound capabilities compared with other systems at the time. It was designed to accommodate the ongoing development of a variety of enhancement chips integrated into game cartridges to be competitive into the next generation. \nThe Super NES received largely positive reviews and was a global success, becoming the bestselling console of the 16-bit era after launching relatively late and facing intense competition from Sega's Genesis console in North America and Europe. Overlapping the NES's 61.9 million unit sales, the Super NES remained popular well into the 32-bit era, with 49.1 million units sold worldwide by the time it was discontinued in 2003. It continues to be popular among collectors and retro gamers, with new homebrew games and Nintendo's emulated rereleases, such as on the Virtual Console, the Super NES Classic Edition, Nintendo Switch Online; as well as several non-console emulators which operate on a desktop computer or mobile device, such as Snes9x.",

    "Turbo Express":
    "Essentially a portable version of the TurboGrafx-16 home console that came two to three years earlier. Its launch price in Japan was ¥44,800 and $249.99 in the U.S. The TurboExpress was technically advanced for the time, able to play all the TurboGrafx-16's HuCard games, featuring a TV tuner and a backlit, active-matrix color LCD screen. The TurboExpress primarily competed with Nintendo's Game Boy, Sega's Game Gear, and the Atari Lynx. With 1.5 million units sold, far behind its two main competitors, NEC failed to gain significant sales or market share in the handheld market.",

    "Commodore 64 Games System":
    "The Commodore 64 Games System (often abbreviated C64GS) is the cartridge-based home video game console version of the popular Commodore 64 home computer. It was released in December 1990 by Commodore into a booming console market dominated by Nintendo and Sega. It was only released in Europe and was a considerable commercial failure. The C64GS came bundled with a cartridge containing four games: Fiendish Freddy's Big Top O'Fun, International Soccer, Flimbo's Quest, and Klax. \nThe C64GS was not Commodore's first gaming system based on the C64 hardware. However, unlike the 1982 MAX Machine (a game-oriented computer based on a very cut-down version of the same hardware family), the C64GS is internally very similar to the complete C64, with which it is compatible. Out of the approximately 80,000 consoles produced, only 20,000 consoles were sold.",

    "Philips CD-i":
    "Philips at first marketed CD-i as a family entertainment product, and avoided mentioning video games to not compete against game consoles. Early software releases focused heavily on educational, music, and self-improvement titles, with only a few games, many of them adaptations of board games such as Connect Four. However, the system was handily beaten in the market for multimedia devices by cheap low-end PCs, and the games were the best-selling software. By 1993 Philips encouraged MS-DOS and console developers to create games, introduced a $250 peripheral with more memory and support for full-motion video, and added to new consoles a second controller port for multiplayer games. \nThe attempts to develop a foothold in the games market were unsuccessful, as the system was designed strictly as a multimedia player and thus was under-powered compared to other gaming platforms on the market in most respects. Earlier CD-i games included entries in popular Nintendo franchises, although those games were not developed by Nintendo. Specifically, a Mario game (titled Hotel Mario), and three Legend of Zelda games that are now infamous were released: Zelda: The Wand of Gamelon, Link: The Faces of Evil and Zelda's Adventure. Nintendo and Philips had established an agreement to co-develop a CD-ROM enhancement for the Super Nintendo Entertainment System due to licensing disagreements with Nintendo's previous partner Sony (an agreement that produced a prototype console called the SNES-CD). While Philips and Nintendo never released such a CD-ROM add-on, Philips was still contractually allowed to use Nintendo characters. \nAs announced at CES 1992, a large number of full motion video titles such as Dragon's Lair and Mad Dog McCree appeared on the system. One of these, Burn:Cycle, is considered one of the stronger CD-i titles and was later ported to PC. The February 1994 issue of Electronic Gaming Monthly remarked that the CD-i's full motion video capabilities were its strongest point, and that nearly all of its best software required the MPEG upgrade card.",

    "3DO Interactive Multiplayer":
    "The 3DO Interactive Multiplayer, also referred to as simply 3DO, is a home video game console developed by The 3DO Company. Conceived by entrepreneur and Electronic Arts founder Trip Hawkins, the 3DO was not a console manufactured by the company itself, but a set of specifications, originally designed by Dave Needle and Robert J. Mical of New Technologies Group, that could be licensed by third parties. Panasonic produced the first models in 1993, and further renditions of the hardware were released afterwards by GoldStar, Sanyo, Creative Labs, and Samsung Electronics in 1997. \nDespite having a highly promoted launch (including being named Time magazine's '1993 Product of the Year'), the console received mixed to negative reviews, and an oversaturated console market prevented the system from achieving success comparable to competing consoles from Sega and Sony, rendering its discontinuation by 1996.",

    "Atari Jaguar":
    "The Atari Jaguar competed with the 16-bit Sega Genesis, the Super NES and the 32-bit 3DO Interactive Multiplayer that launched the same year. Powered by two custom 32-bit processors, 'Tom' and 'Jerry', in addition to a Motorola 68000, Atari marketed it as the world's first 64-bit game system, emphasizing its 64-bit bus used by the blitter. The Jaguar launched with Cybermorph as the pack-in game, which received divisive reviews. The system's library ultimately comprised only 50 licensed games. \nDevelopment of the Atari Jaguar started in the early 1990s by Flare Technology, which focused on the system after cancellation of the Atari Panther console. The Jaguar was an important system for Atari after the company shifted its focus from computers - having ceased development of its Atari ST - back to consoles. However, the multi-chip architecture, hardware bugs, and poor tools made writing games for the Jaguar difficult. Underwhelming sales further eroded the console's third-party support. \nAtari attempted to extend the lifespan of the system with the Atari Jaguar CD add-on, with an additional 13 games, and emphasizing the Jaguar's price of over $100 USD less than its competitors.With the release of the Sega Saturn and PlayStation in 1995, sales of the Jaguar continued to fall. It sold no more than 150,000 units before it was discontinued in 1996. The commercial failure of the Jaguar prompted Atari to leave the console market.",

    "Neo Geo CD":
    "The Neo Geo CD is the second home video game console of SNK Corporation's Neo Geo family, released on September 9, 1994, four years after its cartridge-based equivalent. This is the same platform, converted to the cheaper CD format retailing at $49 to $79 per title, compared to the $300 cartridges. The system was originally priced at US$399, or £399. The system can also play Audio CDs. All three versions of the system have no region-lock. The Neo Geo CD was launched bundled with a control pad instead of a joystick like the AES version. However, the original AES joystick can be used with all three Neo Geo CD models. \nThe Neo Geo CD had met with limited success due to it being plagued with slow loading times that could vary from 30 to 60 seconds between loads, depending on the game. As of March 1997, there had been 570,000 Neo Geo CD units sold worldwide.",

    "Sony PlayStation":
    "The PlayStation is a home video game console developed and marketed by Sony Computer Entertainment. It was released in Japan on 3 December 1994, in North America on 9 September 1995, in Europe on 29 September 1995, and in Australia on 15 November 1995. As a fifth-generation console, the PlayStation primarily competed with the Nintendo 64 and the Sega Saturn. \nSony began developing the PlayStation after a failed venture with Nintendo to create a CD-ROM peripheral for the Super Nintendo Entertainment System in the early 1990s. The console was primarily designed by Ken Kutaragi and Sony Computer Entertainment in Japan, while additional development was outsourced in the United Kingdom. An emphasis on 3D polygon graphics was placed at the forefront of the console's design. PlayStation game production was designed to be streamlined and inclusive, enticing the support of many third-party developers. \nThe console proved popular for its extensive game library, popular franchises, low retail price, and aggressive youth marketing which advertised it as the preferable console for adolescents and adults. Premier PlayStation franchises included Gran Turismo, Crash Bandicoot, Spyro, Tomb Raider, Metal Gear, Tekken, and Final Fantasy, all of which spawned numerous sequels. PlayStation games continued to sell until Sony ceased production of the PlayStation and its games on 23 March 2006—over eleven years after it had been released, and less than a year before the debut of the PlayStation 3. A total of 3,061 PlayStation games were released, with cumulative sales of 967 million units. \nThe PlayStation signalled Sony's rise to power in the video game industry. It received acclaim and sold strongly; in less than a decade, it became the first computer entertainment platform to ship over 100 million units. Its use of compact discs heralded the game industry's transition from cartridges. The PlayStation's success led to a line of successors, beginning with the PlayStation 2 in 2000. In the same year, Sony released a smaller and cheaper model, the PS one.",

    "Sega Saturn":
    "The Sega Saturn is the successor to the successful Sega Genesis. The Saturn has a dual-CPU architecture and eight processors. Its games are in CD-ROM format, and its game library contains several ports of arcade games as well as original games. \nDevelopment of the Saturn began in 1992, the same year Sega's groundbreaking 3D Model 1 arcade hardware debuted. The Saturn was designed around a new CPU from the Japanese electronics company Hitachi. Sega added another video display processor in early 1994 to better compete with Sony's forthcoming PlayStation. \nThe Saturn was initially successful in Japan but failed to sell in large numbers in the United States, where it was hindered by a surprise May 1995 launch, four months before its scheduled release date. After the debut of the Nintendo 64 in late 1996, the Saturn rapidly lost market share in the U.S., where it was discontinued in 1998. Having sold 9.26 million units worldwide, the Saturn is considered a commercial failure; the cancellation of Sonic X-treme, planned as the first 3D entry in Sega's popular Sonic the Hedgehog series, is considered a factor in its performance. The Saturn was succeeded in 1998 by the Dreamcast. \nAlthough the Saturn is remembered for several well-regarded games, including Nights into Dreams, the Panzer Dragoon series and the Virtua Fighter series, its reputation is mixed due to its complex hardware design and limited third-party support. Sega's management has been criticized for its decisions during the Saturn's development and discontinuation.",

    "Sega Nomad / Genesis Nomad":
    "The Nomad is a portable variation of the Sega Genesis home video game console (known as the Mega Drive outside North America). It could also be used with a television set via a video port. It was based on the Mega Jet, a portable version of the home console designed for use on airline flights in Japan. \nThe Nomad was the last handheld console released by Sega. Released late in the Genesis era, it had a short lifespan. It was sold exclusively in North America, and uses regional lockout. Sega's focus on the Sega Saturn left the Nomad under-supported, and it was incompatible with several Genesis peripherals, including the Power Base Converter, the Sega CD, and the 32X. About 1 million units of the Nomad were sold, and it is considered a commercial failure.",

    "Nintendo 64":
    "The successor to the Super Nintendo Entertainment System, it was the last major home console to use cartridges as its primary storage format until the Nintendo Switch in 2017. It competed primarily with the Sony PlayStation and the Sega Saturn. \nDevelopment began in 1993 in partnership with Silicon Graphics, using the codename Project Reality, then a test model and arcade platform called Ultra 64. The final design was named after its 64-bit CPU, which aided in the console's 3D capabilities. Its design was mostly complete by mid-1995 and launch was delayed until 1996 for the completion of the launch games Super Mario 64, Pilotwings 64, and Saikyō Habu Shōgi (exclusive to Japan). The charcoal-gray console was followed by a series of color variants. \nSome games require the Expansion Pak accessory to increase system RAM from 4MB to 8MB, for improved graphics and functionality. The console mainly supports saved game storage either onboard cartridges or on the Controller Pak accessory. The 64DD peripheral drive hosts both exclusive games and expansion content for cartridges, with many further accessories plus the defunct Internet service Randnet, but it was a commercial failure and was released only in Japan. \nTime named it Machine of the Year in 1996, and in 2011, IGN named it the ninth-greatest video game console of all time. The Nintendo 64 was discontinued in 2002 following the 2001 launch of its successor, the GameCube. The Nintendo 64 was critically acclaimed and remains one of the most recognized video game consoles.",

    "Neo Geo Pocket":
    "The Neo Geo Pocket is a monochrome handheld game console released by SNK. It was the company's first handheld system and is part of the Neo Geo family. It debuted in Japan in late 1998 but never saw an American release, being exclusive to Japan, Asia and Europe. The Neo Geo Pocket received lower than expected sales and it was discontinued in 1999, immediately being succeeded by the Neo Geo Pocket Color, a full color device allowing the system to compete more easily with the dominant Game Boy Color handheld, and which also saw an American release. Though the system enjoyed only a short life, there were some significant games released on the system such as Samurai Shodown, and King of Fighters R-1.",

    "Dreamcast":
    "The Dreamcast was developed by an internal Sega team led by Hideki Sato. In contrast to the expensive hardware of the unsuccessful Saturn, the Dreamcast was designed to reduce costs with off-the-shelf components, including a Hitachi SH-4 CPU and an NEC PowerVR2 GPU. Sega used the GD-ROM media format to avoid the expenses of DVD-ROM technology and an optional, custom version of the Windows CE operating system to make porting PC games easy. The Dreamcast was the first console to include a built-in modular modem for internet access and online play. \nThe Dreamcast was released to a subdued reception in Japan, but had a successful US launch backed by a large marketing campaign. However, interest steadily declined as Sony built anticipation for the PlayStation 2. Dreamcast sales did not meet Sega's expectations after several price cuts, and the company suffered significant financial losses. After a change in leadership, Sega discontinued the Dreamcast on March 31, 2001, withdrew from the console business, and restructured itself as a third-party developer. 9.13 million Dreamcast units were sold worldwide. Its bestselling game, Sonic Adventure (1998)—the first 3D game in Sega's Sonic the Hedgehog franchise—sold 2.5 million copies. \nDespite its short lifespan and limited third-party support, reviewers have celebrated the Dreamcast as one of the greatest consoles. It is considered ahead of its time for pioneering concepts such as online play and downloadable content. Many Dreamcast games are regarded as innovative, including Sonic Adventure, Crazy Taxi (1999), Shenmue (1999), Jet Set Radio (2000), Phantasy Star Online (2000), and high-quality ports from Sega's NAOMI arcade system board. The Dreamcast was Sega's final console; its 2001 discontinuation ended the company's eighteen years in the console market.",

    "WonderSwan":
    "Powered by a 16-bit processor, the WonderSwan took advantage of a low price point and long battery life in comparison to its competition, Nintendo's Game Boy Color and SNK's Neo Geo Pocket Color. Later improvements took advantage of quality upgrades to the handheld's screen and added color. The WonderSwan is playable both vertically and horizontally, and features a unique library of games, including numerous first-party titles based on licensed anime properties, as well as significant third-party support from developers such as Squaresoft, Namco, Capcom and Banpresto. \nOverall, the WonderSwan in all its variations combined to sell an estimated 3.5 million units and managed to obtain as much as 8% of the Japanese handheld video game console market before being marginalized by Nintendo's Game Boy Advance. Retrospective feedback praises the potential of the WonderSwan despite its low sales and its brief time holding its own against Nintendo in the marketplace.",

    "PlayStation 2":
    "The PlayStation 2 competed with Nintendo's GameCube, Sega's Dreamcast, and Microsoft's Xbox. It is the best-selling video game console of all time, having sold over 155 million units worldwide. Announced in 1999, Sony began developing the console after the immense success of its predecessor. The highlight of the system was its Emotion Engine processor, co-developed by Sony and Toshiba, which was said to be more powerful than personal computers. The PS2 offered backward-compatibility for its predecessor's DualShock controller, as well as its games. \nThe PlayStation 2 received widespread critical acclaim upon release. A total of over 4,000 game titles were released worldwide, with over 1.5 billion copies sold. In 2004, Sony released a smaller, lighter revision of the console known as the PS2 Slim. Even after the release of its successor, the PlayStation 3, it remained popular well into the seventh generation. It continued to be produced until the beginning of 2013 when Sony finally announced that it had been discontinued after over twelve years of production, one of the longest lifespans of any video game console. New games for the console continued to be released until even shortly after the end of its life and support from Sony.",

    "Nintendo GameCube":
    "Development on the GameCube was enabled by the 1997 formation of computer graphics company ArtX, of former SGI employees who had created the Nintendo 64, and which was later acquired by ATI to produce the GameCube's GPU. In May 1999, Nintendo announced codename Dolphin, released in 2001 as the GameCube. It is Nintendo's first console to use optical discs instead of ROM cartridges, supplemented by writable memory cards for saved games. Unlike its competitors, it is solely focused on gaming and does not play mass media like DVD or CD. \nThe console supports limited online gaming for a few games via a GameCube broadband or modem adapter and can connect to a Game Boy Advance with a link cable for exclusive in-game features using the handheld as a second screen and controller. The GameCube supports e-Reader cards to unlock special features in a few games. The Game Boy Player add-on runs Game Boy, Game Boy Color, and Game Boy Advance cartridge games. \nReception of the GameCube was mixed. It was praised for its controller and extensive library of high-quality games, but was criticized for its exterior design and lack of multimedia features. Nintendo sold 21.74 million GameCube units worldwide, much fewer than anticipated, and discontinued it in 2007. It was succeeded by the Wii; the first model launched in November 2006 with full backward compatibility with GameCube games and most accessories.",

    "Xbox":
    "The console was announced in March 2000. With the release of the PlayStation 2, which featured the ability to playback CD-ROMs and DVDs in addition to playing games, Microsoft became concerned that game consoles would threaten the personal computer as an entertainment device for living rooms. Whereas most games consoles to that point were built from custom hardware components, the Xbox was built around standard personal computer components, using variations of Microsoft Windows and DirectX as its operating system to support games and media playback, and featuring a 733 MHz Intel Pentium III CPU and a 233 MHz Nvidia GeForce 3-based NV2A GPU, the latter two making the Xbox technically more powerful compared to its rivals. \nThe Xbox was the first console to feature a built-in hard disk. The console also was built with direct support for broadband connectivity to the Internet via an integrated Ethernet port, and with the release of Xbox Live, a fee-based online gaming service, a year after the console's launch, Microsoft gained an early foothold in online gaming and made the Xbox a strong competitor in the sixth generation of consoles. The popularity of killer app blockbuster titles such as Bungie's Halo 2 contributed to the popularity of online console gaming, and in particular first-person shooters. \nThe Xbox had a record-breaking launch in North America, selling 1.5 million units before the end of 2001, aided by the popularity of one of the system's launch titles, Halo: Combat Evolved, which sold a million units by April 2002. The system went on to sell a worldwide total of 24 million units, including 16 million in North America; however, Microsoft was unable to make a steady profit off the console, which had a manufacturing price far more expensive than its retail price, despite its popularity, losing over $4 billion during its market life. \nThe system outsold the GameCube and the Sega Dreamcast, but was vastly outsold by the PlayStation 2, which had sold over 100 million units by the system's end of production. It also underperformed outside of the Western market; particularly, it sold poorly in Japan due to its large console size and an overabundance of games marketed towards American audiences instead of Japanese-developed titles. Production of the system was discontinued starting in 2005. The Xbox was the first in an ongoing brand of video game consoles developed by Microsoft, with a successor, the Xbox 360, launching in November 2005, followed by the Xbox One in 2013 and the Xbox Series X and Series S consoles in 2020.",

    "Game Boy Advance":
    "The Game Boy Advance (GBA) is a 32-bit handheld game console developed, manufactured and marketed by Nintendo as the successor to the Game Boy Color. It was released in Japan on March 21, 2001, in North America on June 11, 2001, in the PAL region on June 22, 2001, and in mainland China as iQue Game Boy Advance on June 8, 2004. The GBA is part of the sixth generation of video game consoles. The original model was followed in 2003 by the Game Boy Advance SP, a redesigned model with a frontlit screen and clamshell form factor. A newer revision of the SP with a backlit screen was released in 2005. A miniaturized redesign, the Game Boy Micro, was released in September 2005.  \nAs of June 2010, 81.51 million units of the Game Boy Advance series have been sold worldwide. Its successor, the Nintendo DS, was released in November 2004 and is backward compatible with Game Boy Advance software.",

    "N-Gage":
    "The N-Gage is a smartphone combining features of a mobile phone and a handheld game system developed by Nokia, announced on 4 November 2002 and released on 7 October 2003. It runs the original Series 60 platform on Symbian OS v6.1. \nN-Gage attempted to lure gamers away from the Game Boy Advance by including telephone functionality. This was unsuccessful, partly because the buttons, designed for a telephone, were not well-suited for gaming. The original N-Gage was described as resembling a taco, which led to its mocking nickname 'taco phone'. \nNokia introduced the N-Gage QD in 2004 as a redesign of the original 'Classic' N-Gage, fixing widely criticized issues and design problems. However, the new model was unable to make an impact, and with only 2 million units sold in its two years, the N-Gage and its QD model were a commercial failure, unable to challenge their Nintendo rival. \nThe N-Gage was discontinued in February 2006, with Nokia moving its gaming capabilities onto selected Series 60 smartphones. This was announced as the N-Gage platform or 'N-Gage 2.0' in 2007, carrying on the N-Gage name.",

    "PlayStation Portable":
    "Development of the PSP was announced during E3 2003, and the console was unveiled at a Sony press conference on May 11, 2004. The system was the most powerful portable console when it was introduced, and was the first real competitor of Nintendo's handheld consoles after many challengers such as Nokia's N-Gage had failed. The PSP's advanced graphics capabilities made it a popular mobile entertainment device, which could connect to the PlayStation 2 and PlayStation 3, any computer with a USB interface, other PSP systems, and the Internet. The PSP also had a vast array of multimedia features such as video playback, audio playback, and has been considered a portable media player as well. The PSP is the only handheld console to use an optical disc format—in this case, Universal Media Disc (UMD)—as its primary storage medium; both games and movies have been released on the format. \nThe PSP was received positively by critics, and sold over 80 million units during its ten-year lifetime. Several models of the console were released, before the PSP line was succeeded by the PlayStation Vita, released in Japan in 2011 and worldwide a year later. The Vita has backward compatibility with PSP games that were released on the PlayStation Network through the PlayStation Store, which became the main method of purchasing PSP games after Sony shut down access to the store from the PSP on March 31, 2016. Hardware shipments of the PSP ended worldwide in 2014; production of UMDs ended when the last Japanese factory producing them closed in late 2016.",

    "Nintendo DS":
    "Prior to its release, the Nintendo DS was marketed as an experimental 'third pillar' in Nintendo's console lineup, meant to complement the Game Boy Advance family and GameCube. However, backward compatibility with Game Boy Advance titles and strong sales ultimately established it as the successor to the Game Boy series. On March 2, 2006, Nintendo launched the Nintendo DS Lite, a slimmer and lighter redesign of the original Nintendo DS with brighter screens and a longer lasting battery. On November 1, 2008, Nintendo released the Nintendo DSi, another redesign with several hardware improvements and new features, although it lost backwards compatibility for Game Boy Advance titles and a few DS games that used the GBA slot. On November 21, 2009, Nintendo released the Nintendo DSi XL, a larger version of the DSi. \nAll Nintendo DS models combined have sold 154.02 million units, making it the best-selling Nintendo system, the best-selling handheld game console to date, and the second-best-selling video game console of all time, overall, behind Sony's PlayStation 2. The Nintendo DS was succeeded by the Nintendo 3DS in February 2011.",

    "Xbox 360":
    "Launched worldwide across 2005-2006, the Xbox 360 was initially in short supply in many regions, including North America and Europe. The earliest versions of the console suffered from a high failure rate, indicated by the so-called 'Red Ring of Death', necessitating an extension of the device's warranty period. Microsoft released two redesigned models of the console: the Xbox 360 S in 2010, and the Xbox 360 E in 2013. Xbox 360 is the ninth-highest-selling home video game console in history, and the highest-selling console made by an American company. Although not the best-selling console of its generation, the Xbox 360 was deemed by TechRadar to be the most influential through its emphasis on digital media distribution and multiplayer gaming on Xbox Live.",

    "PlayStation 3":
    "The console was first officially announced at E3 2005, and was released at the end of 2006. It was the first console to use Blu-ray Disc technology as its primary storage medium. The console was the first PlayStation to integrate social gaming services, including the PlayStation Network, as well as the first to be controllable from a handheld console, through its remote connectivity with PlayStation Portable and PlayStation Vita. In September 2009, the Slim model of the PlayStation 3 was released. It no longer provided the hardware ability to run PS2 games. It was lighter and thinner than the original version, and featured a redesigned logo and marketing design, as well as a minor start-up change in software. A Super Slim variation was then released in late 2012, further refining and redesigning the console. \nDuring its early years, the system received a mixed reception, due to its high price ($599 for a 60-gigabyte model, $499 for a 20 GB model), a complex processor architecture, and lack of quality games but was praised for its Blu-ray capabilities and 'untapped potential'. The reception would get more positive over time. The system had a slow start in the market but managed to recover, particularly after the introduction of the Slim model. Its successor, the PlayStation 4, was released later in November 2013. On September 29, 2015, Sony confirmed that sales of the PlayStation 3 were to be discontinued in New Zealand, but the system remained in production in other markets. Shipments of new units to Europe and Australia ended in March 2016, followed by North America which ended in October 2016. Heading into 2017, Japan was the last territory where new units were still being produced until May 29, 2017, when Sony confirmed the PlayStation 3 was discontinued in Japan.",

    "Wii":
    "In developing the Wii, Nintendo president Satoru Iwata directed the company to avoid competing with Microsoft and Sony on computational graphics and power and instead to target a broader demographic of players through novel gameplay. Game designers Shigeru Miyamoto and Genyo Takeda led the console's development under the codename Revolution. The primary controller for the Wii is the Wii Remote, a wireless controller with both motion sensing and traditional controls which can be used as a pointing device towards the television screen or for gesture recognition. The Wii was Nintendo's first home console to directly support Internet connectivity, supporting both online games and for digital distribution of games and media applications through the Wii Shop Channel. \nThe Wii also supports wireless connectivity with the Nintendo DS handheld console for selected games. Initial Wii models included full backward compatibility support for the GameCube. Later in its lifecycle, two lower-cost Wii models were produced: a revised model with the same design as the original Wii but removed the GameCube compatibility features and the Wii Mini, a compact, budget redesign of the Wii which further removed features including online connectivity and SD card storage. \nBecause of Nintendo's reduced focus on computational power, the Wii and its games were less expensive to produce than its competitors. The Wii was extremely popular at launch, causing the system to be in short supply in some markets. A bundled game, Wii Sports, was considered the killer app for the console; other flagship games included entries in the Super Mario, Legend of Zelda, Pokémon, and Metroid series. Within a year of launch, the Wii became the best-selling seventh-generation console, and by 2013, had surpassed over 100 million units sold. Total lifetime sales of the Wii had reached over 101 million units, making it Nintendo's best-selling home console until it was surpassed by the Nintendo Switch in 2021. As of 2022, the Wii is the fifth-best-selling home console of all time.",

    "PlayStation Vita":
    "The original model of the handheld includes a 5-inch (130 mm) OLED multi-touch capacitive touchscreen, two analog joysticks, and front and shoulder push-button input, and supports Bluetooth, Wi-Fi, and optional 3G. The Vita features a quad-core ARM Cortex-A9 MPCore CPU and a quad-core SGX543MP GPU. The PS Vita 2000 series, a revised version of the system, was released across 2013 and 2014. It has all of the same features with a slightly smaller size, extended battery life, and an LCD screen instead of OLED. Sony released the PlayStation TV, a short-lived, re-purposed version of the Vita that uses a television screen like a home video game console, discontinued at the end of 2015. \nThe Vita's design was intended to meld the experience of big-budget, dedicated video game platforms with the then up-and-coming trend of mobile gaming as seen on smart phones and tablets. However, in the year after the device's successful launch, sales of the hardware and its bigger budget games stalled, threatening to end its lifespan. A concentrated effort to attract smaller independent developers in the West, combined with strong support from mid-level Japanese companies, helped keep the platform afloat. \nThough this led to less diversity in its game library, it strengthened support in JRPGs, visual novels, and Western-developed indie games. This built moderate sales in Japan and a smaller yet passionate userbase in the West. Though Sony has not released exact sales figures, estimates are around 15 to 16 million units. In the platform's later years, Sony promoted the PlayStation Vita's ability to work in conjunction with its other gaming products, such as Remote Play of PlayStation 4 games, similar to the Wii U's function of Off-TV Play.\n ...and yes, Vita means life.",

    "Nintendo 3DS":
    "The handheld's most prominent feature is its ability to display stereoscopic 3D effects without the use of 3D glasses or additional accessories, and it offers new features such as the StreetPass and SpotPass tag modes, powered by Nintendo Network; augmented reality using its 3D cameras; and Virtual Console, which allows owners to download and play games originally released on older video game systems. \nThe Nintendo 3DS was released in Japan on February 26, 2011, and worldwide beginning in March 2011. Less than six months later on July 28, 2011, Nintendo announced a significant price reduction from US$249.99 to US$169.99 amid disappointing launch sales. The company offered ten free NES games and ten free Game Boy Advance games from the Nintendo eShop to consumers who bought the system at the original launch price. This strategy was considered a major success, and the console went on to become one of Nintendo's most successful handheld consoles in the first two years of its release. As of September 30, 2022, the Nintendo 3DS family of systems combined have sold 75.94 million units, and games for the systems have sold 388.89 million units. \nThe 3DS had multiple variants over the course of its life. The Nintendo 3DS XL, a larger model featuring a 90% larger screen, was first released in Japan and Europe in July 2012. In August 2012, it launched in the US for $199.99. An 'entry-level' version of the console, the Nintendo 2DS, with a fixed 'slate' form factor and lacking autostereoscopic (3D) functionality, was released in Western markets in October 2013. The New Nintendo 3DS features a more powerful CPU, a second analog stick called the C-Stick, additional buttons, an improved camera, and other changes, and was first released in Japan in October 2014.\n3DS family hardware was officially discontinued on September 16, 2020. While Nintendo Network services remain active in most regions, the Nintendo eShop officially shut down on March 27, 2023.",

    "Wii U":
    "The Wii U is the first Nintendo console to support HD graphics. The system's primary controller is the Wii U GamePad, which features an embedded touchscreen, directional buttons, analog sticks, and action buttons. The screen can be used either as a supplement to the main display or in supported games to play the game directly on the GamePad. The Wii U Pro Controller can be used in its place as a more traditional alternative. The Wii U is backward compatible with all Wii software and accessories. Games can support any combination of the GamePad, Wii Remote, Nunchuk, Balance Board, or Nintendo's Classic Controller or Wii U Pro Controller. Online functionality centers around the Nintendo Network platform and Miiverse, an integrated social networking service which allowed users to share content in game-specific communities.\nResponse to the Wii U was mixed. It was praised for its innovative GamePad controller, improvements to online functionality over the Wii, backwards compatibility with Wii software and peripherals, and price; however, it was criticized for its user interface and functionality, and the GamePad's short battery life. It had low sales, primarily credited to a weak lineup of launch games, limited third-party support, and poor marketing including the lack of distinguishing the unique functionality of the GamePad from just being a tablet device for the Wii. Wii U production ended in January 2017. On March 3, 2017, Nintendo released its successor, the Nintendo Switch, which retained and refined concepts introduced with the Wii U.",

    "PlayStation 4":
    "Moving away from the more complex Cell microarchitecture of its predecessor, the console features an AMD Accelerated Processing Unit (APU) built upon the x86-64 architecture, which can theoretically peak at 1.84 teraflops; AMD stated that it was the 'most powerful' APU it had developed to date. The PlayStation 4 places an increased emphasis on social interaction and integration with other devices and services, including the ability to play games off-console on PlayStation Vita and other supported devices ('Remote Play'), the ability to stream gameplay online or to friends, with them controlling gameplay remotely ('Share Play'). The console's controller was also redesigned and improved over the PlayStation 3, with improved buttons and analog sticks, and an integrated touchpad among other changes. The console also supports HDR10 High-dynamic-range video and playback of 4K resolution multimedia.\nThe PlayStation 4 was released to critical acclaim, with critics praising Sony for acknowledging its consumers' needs, embracing independent game development, and for not imposing the restrictive digital rights management schemes like those originally announced by Microsoft for the Xbox One. Critics and third-party studios, before its launch, also praised the capabilities of the PlayStation 4 in comparison to its competitors; developers described the performance difference between the console and Xbox One as 'significant' and 'obvious'. Heightened demand also helped Sony top global console sales. By October 2019, PS4 became the second-best-selling home game console of all time, behind the PlayStation 2.\nOn September 7, 2016, Sony unveiled the PlayStation 4 Slim, a smaller version of the console; and a high-end version called the PlayStation 4 Pro, which features an upgraded GPU and a higher CPU clock rate to support enhanced performance and 4K resolution in supported games.\nIts successor, the PlayStation 5, was released in November 2020, with Sony discontinuing in Japan all PlayStation 4 models except the Slim version in January 2021, with it still being produced in Western markets following their statement of 3-year support of PS4.",

    "Xbox One":
    "Moving away from its predecessor's PowerPC-based architecture, the Xbox One marks a shift back to the x86 architecture used in the original Xbox; it features an AMD Accelerated Processing Unit (APU) built around the x86-64 instruction set. Xbox One's controller was redesigned over the Xbox 360's, with a redesigned body, D-pad, and triggers capable of delivering directional haptic feedback. The console places an increased emphasis on cloud computing, as well as social networking features and the ability to record and share video clips or screenshots from gameplay or livestream directly to streaming services such as Mixer and Twitch. Games can also be played off-console via a local area network on supported Windows 10 devices. The console can play Blu-ray Disc, and overlay live television programming from an existing set-top box or a digital tuner for digital terrestrial television with an enhanced program guide. The console optionally included a redesigned Kinect sensor, marketed as the 'Kinect 2.0', providing improved motion tracking and voice recognition.\nThe Xbox One received positive reviews for its refined controller design, multimedia features, and voice navigation. Its quieter and cooler design was praised for making the console more reliable than its predecessor at launch, but the console was generally criticized for running games at a technically lower graphical level than the PlayStation 4. Its original user interface was panned for being nonintuitive, although changes made to it and other aspects of the console's software post-launch received a positive reception. Its Kinect received praise for its improved motion-tracking accuracy, its face recognition logins, and its voice commands.\nThe original Xbox One model was succeeded by the Xbox One S in 2016, which has a smaller form factor and support for HDR10 high-dynamic-range video, as well as support for 4K video playback and upscaling of games from 1080p to 4K. It was praised for its smaller size, its on-screen visual improvements, and its lack of an external power supply, but its regressions such as the lack of a native Kinect port were noted. A high-end model, named Xbox One X, was unveiled in June 2017 and released in November; it features upgraded hardware specifications and support for rendering games at 4K resolution. The system was succeeded by the Xbox Series X and Series S consoles, which launched on November 10, 2020. Production of all Xbox One consoles ceased at the end of that year.",

    "Nintendo Switch":
    "The Nintendo Switch was unveiled on October 20, 2016. Known in development by its codename NX, the concept of the Switch came about as Nintendo's reaction to several quarters of financial losses into 2014, attributed to poor sales of its previous console, the Wii U, and market competition from mobile games. Nintendo's then-president Satoru Iwata pushed the company towards mobile gaming and novel hardware. The Nintendo Switch's design is aimed at a wide demographic of video game players through multiple modes of use. Nintendo opted to use more standard electronic components, such as a chipset based on Nvidia's Tegra line, to make development for the console easier for programmers and more compatible with existing game engines. As the Wii U had struggled to gain external support, leaving it with a weak software library, Nintendo preemptively sought the support of many third-party developers and publishers to help build out the Switch's game library alongside Nintendo's first-party titles, including many independent video game studios. While Nintendo initially anticipated around 100 titles for its first year, over 320 titles from first-party, third-party, and independent developers were released by the end of 2017.\nThe Switch was released in the middle of the eighth generation of home consoles and competed with Microsoft's Xbox One and Sony's PlayStation 4; in its lifetime it also competed with the ninth-generation consoles, Microsoft's Xbox Series X and Series S and Sony's PlayStation 5. As of March 2023, all Nintendo Switch models have sold over 125 million units worldwide, making it Nintendo's best-selling home console and the third-best-selling game console of all time, behind the PlayStation 2 and Nintendo DS. Sales of the Switch have been strongly tied to sales of Nintendo's first-party titles, with seven games—The Legend of Zelda: Breath of the Wild, Mario Kart 8 Deluxe, Super Mario Odyssey, Super Smash Bros. Ultimate, Pokémon Sword and Shield, Animal Crossing: New Horizons, and Pokémon Scarlet and Violet—having sold over twenty million units each.",

    "Xbox Series X":
    "Like the Xbox One, the console uses an AMD 64-bit x86-64 CPU and GPU. Both models have solid-state drives to reduce loading times, support for hardware-accelerated ray-tracing and spatial audio, the ability to convert games to high-dynamic-range rendering using machine learning (Auto HDR), support for HDMI 2.1 variable refresh rate and low-latency modes, and updated controllers. Xbox Series X was designed to nominally render games in 2160p (4K resolution) at 60 frames per second (FPS). The lower-end, digital-only Xbox Series S, which has reduced specifications and does not include an optical drive, was designed to nominally render games in 1440p at 60 FPS, with support for 4K video scaling and ray tracing.\nXbox Series X/S are backwards-compatible with nearly all Xbox One-compatible games and accessories (including Xbox 360 and original Xbox games that were made backward-compatible with Xbox One); the newer hardware gives games better performance and visuals. At launch, Microsoft encouraged a 'soft' transition between generations, similar to PC gaming, offering the 'Smart Delivery' framework to allow publishers to provide upgraded versions of Xbox One titles with optimizations for Xbox Series X/S. Publishers are not required to use Smart Delivery and may publish Xbox Series X/S-exclusive titles if they choose. Electronic Arts is among the developers that do not use Smart Delivery.\nCritics praised the Xbox Series X/S for the hardware improvements over Xbox One and Microsoft's emphasis on cross-generation releases, but believed that the games available at launch did not fully use the hardware capabilities. Microsoft has not released sales data for the Xbox Series X/S but said on July 27, 2021, that they were the fastest-selling Xbox models to date. It was estimated that Microsoft had shipped at least 18.5 million units of the two consoles worldwide by December 2022.\nIn June 2023, during an ID@Xbox presentation at the Best International Games (BIG) Festival in Brazil, Microsoft revealed that over 21 million Xbox Series consoles have been sold worldwide.",

    "PlayStation 5":
    "The PlayStation 5's main hardware features include a solid-state drive customized for high-speed data streaming to enable significant improvements in storage performance, an AMD GPU capable of 4K resolution display at up to 120 frames per second, hardware-accelerated ray tracing for realistic lighting and reflections, and the Tempest Engine for hardware-accelerated 3D audio effects. Other features include the DualSense controller with haptic feedback, backward compatibility with the majority of PlayStation 4 and PlayStation VR games, and the PlayStation VR2 headset."
}